//  bat='Bat', c='C', Cpp='Cpp', cs='CS', css='CSS', html='HTML', java='Java', js='JS',
//  pascal='Pascal', php='PHP', python='Python', sql='SQL';
//  abc='ABC', ac='AC', as='AS', atom='Atom', c4d='C4D', excel='Excel', figma='Figma', github='GitHub',
//  idle='IDLE', n='Notepad', np='NP', os='OS', paint='Paint', pc='PC', ps='PS', vb='VB',
//  vpn='VPN', vs='VS', vsc='VSC', word='Word';
//  composer='Composer', laravel='Laravel', node='Node', qt='QT', unity='Unity', wp='WP';

var listPart={
    lang: [
        ["Прога 01", 2018, bat, np, "bat/bat01.png", "Описание 111 ..."],
        ["Прога 02", 2019, bat, np, "bat/bat02.png", "Описание 222 ..."],
        ["Прога 03", 2020, bat, np, "bat/bat03.png", "Описание 333 ..."],
        ["Прога 04", 2026, bat, np, "bat/bat09.png", "Описание 999 ..."]
    ],
    tool: [
        ["Прога 11", 2018, bat, np, "bat01.png", "Описание 111 ..."],
        ["Прога 12", 2019, bat, np, "bat02.png", "Описание 222 ..."],
        ["Прога 13", 2020, bat, np, "bat03.png", "Описание 333 ..."],
        ["Прога 14", 2026, bat, np, "bat09.png", "Описание 999 ..."]
    ],
    site: [
        ["Прога 21", 2018, bat, np, "bat01.png", "Описание 111 ..."],
        ["Прога 22", 2019, bat, np, "bat02.png", "Описание 222 ..."],
        ["Прога 23", 2020, bat, np, "bat03.png", "Описание 333 ..."],
        ["Прога 24", 2026, bat, np, "bat09.png", "Описание 999 ..."]
    ]
 };

 var listProg={
    listBat: [
        ["Hello World!", 2018, bat, n, "bat/bat01.png", "Первая программа. На любом компьютере. Без скачиваний и установок. В блокноте и на bat-нике."],
        ["Проверка пароля", 2018, bat, n, "bat/bat02.png", "Простейшая логика любой программы. Ввод - проверка ввода - вывод в зависимости от результате проверки."],
        ["Строковый калькулятор", 2018, bat, n, "bat/bat03.png", "Еще одна простая логика. Ввод - обработка данных - вывод результата."],
        ["Треугольник нарастающий", 2018, bat, np, "bat/bat04.png", "Наглядный пример работы цикла с счетчиком."],
        ["Треугольник убывающий", 2018, bat, np, "bat/bat05.png", "Работа цикла с отсчетом в обратном порядке."],
        ["Квадрат", 2018, bat, np, "bat/bat06.png", "Совмещение работы разных циклов. Признаки повторения кода."],
        ["Больше-меньше", 2018, bat, np, "bat/bat07.png", "Простейшая консольная игра с рандомом, выбором из 2 вариантов и выводом результата."],
        ["Камень-ножницы-бумага", 2018, bat, np, "bat/bat08.png", "Простая консольная игра с выбором из 3 вариантом и комбинированной логикой."],
        ["Анимация", 2018, bat, np, "bat/bat09.png", "Анимация в консоли - выходим за рамки стандартного программирования."],
        ["Очистка папки temp", 2019, bat, np, "bat/bat10.png", "Простая и полезная программка."]
    ],
    listCpp: [
        ["Hello World!", 2018, Cpp, vs, "cpp/cpp10.png", "Традиционное знакомство с C++."],
        ["Больше-меньше", 2018, Cpp, vs, "cpp/cpp11.png", "Применяем goto и метки, прежде чем перейти к функциям."],
        ["Таблица умножения", 2018, Cpp, vs, "cpp/cpp12.png", "Практическое применение функций."]
    ],
    listJS: [
        ["Змейка", 2018, js, np, "JS/Snake.png", "Игра \"Змейка\" - легендарная классика электронных игр."],
        ["Жизнь", 2021, js, vsc, "JS/Life.jpg", "Игра \"Жизнь\" - знакомство с клеточными автоматами."],
        ["Звезды", 2021, js, vsc, "JS/Stars.jpg", "Знакомство с анимацией для украшений веб-страниц."],
        ["Муравейник", 2021, js, vsc, "JS/Anthill.jpg", "Симулятор муравейника."]
    ],
    listJava: [
        ["Прога lang4_01", 2018, bat, np, "bat01.png", "Описание 111 ..."],
        ["Прога lang4_02", 2019, bat, np, "bat02.png", "Описание 222 ..."],
        ["Прога lang4_03", 2020, bat, np, "bat03.png", "Описание 333 ..."],
        ["Прога lang4_04", 2021, bat, np, "bat04.png", "Описание 444 ..."],
        ["Прога lang4_05", 2022, bat, np, "bat05.png", "Описание 555 ..."],
        ["Прога lang4_06", 2023, bat, np, "bat06.png", "Описание 666 ..."],
        ["Прога lang4_07", 2024, bat, np, "bat07.png", "Описание 777 ..."],
        ["Прога lang4_08", 2025, bat, np, "bat08.png", "Описание 888 ..."],
        ["Прога lang4_09", 2019, bat, np, "bat02.png", "Описание 222 ..."],
        ["Прога lang4_10", 2020, bat, np, "bat03.png", "Описание 333 ..."],
        ["Прога lang4_11", 2026, bat, np, "bat09.png", "Описание 999 ..."]
    ],
    listPas: [
        ["Прога lang5_01", 2018, bat, np, "bat01.png", "Описание 111 ..."],
        ["Прога lang5_02", 2019, bat, np, "bat02.png", "Описание 222 ..."],
        ["Прога lang5_03", 2020, bat, np, "bat03.png", "Описание 333 ..."],
        ["Прога lang5_04", 2026, bat, np, "bat09.png", "Описание 999 ..."]
    ],
    listCS: [
        ["Прога lang6_01", 2018, bat, np, "bat01.png", "Описание 111 ..."],
        ["Прога lang6_02", 2019, bat, np, "bat02.png", "Описание 222 ..."],
        ["Прога lang6_03", 2020, bat, np, "bat03.png", "Описание 333 ..."],
        ["Прога lang6_04", 2026, bat, np, "bat09.png", "Описание 999 ..."]
    ],
    listPy: [
        ["Прога lang7_01", 2018, bat, np, "bat01.png", "Описание 111 ..."],
        ["Прога lang7_02", 2019, bat, np, "bat02.png", "Описание 222 ..."],
        ["Прога lang7_03", 2020, bat, np, "bat03.png", "Описание 333 ..."],
        ["Прога lang7_04", 2026, bat, np, "bat09.png", "Описание 999 ..."]
    ]
};