//Программа обучения детей программированию

const
    listOther={
        lang: {
            title: [],
            content: [
                ["Прога 01", 2018, bat, np, "img/bat/bat01.png", "Описание 111 ..."],
                ["Прога 02", 2019, bat, np, "img/bat/bat02.png", "Описание 222 ..."],
                ["Прога 03", 2020, bat, np, "img/bat/bat03.png", "Описание 333 ..."],
                ["Прога 04", 2026, bat, np, "img/bat/bat09.png", "Описание 999 ..."]
            ]
        },
        tool: {
            title: [],
            content: [
                ["Прога 11", 2018, bat, np, "img/bat/bat01.png", "Описание 111 ..."],
                ["Прога 12", 2019, bat, np, "img/bat/bat02.png", "Описание 222 ..."],
                ["Прога 13", 2020, bat, np, "img/bat/bat03.png", "Описание 333 ..."],
                ["Прога 14", 2026, bat, np, "bat/bat09.png", "Описание 999 ..."]
            ]
        },
        site: {
            title: ['Первые сайты - наждачкой по глазам'],
            content: [
                ["Прога 21", 2018, bat, np, "img/bat/bat01.png", "Описание 111 ..."],
                ["Прога 22", 2019, bat, np, "img/bat/bat02.png", "Описание 222 ..."],
                ["Прога 23", 2020, bat, np, "img/bat/bat03.png", "Описание 333 ..."],
                ["Прога 24", 2026, bat, np, "img/bat/bat09.png", "Описание 999 ..."]
            ]
        }
    };